tap "buo/cask-upgrade"
tap "jandedobbeleer/oh-my-posh"

brew "adr-tools"
brew "aria2"
brew "awscli"
brew "bash-completion"
brew "clang-format"
brew "cmake"
brew "ctags"
brew "curl"
brew "diff-so-fancy"
brew "dockutil"
brew "duti"
brew "exiftool"
brew "fdk-aac" # Git Video
brew "ffmpeg"
brew "flac"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "gist"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "git-svn"
brew "gitlab-runner"
brew "gnupg"
brew "go"
brew "gource" # Git Video
brew "graphviz"
brew "helm"
brew "htop"
brew "icdiff"
brew "id3v2"
brew "imagemagick" # SVGify
brew "img2pdf"
brew "jq"
brew "jsign" # Needed for .exe signing, also install "SafeNet Authentication Client"!
brew "k3d"
brew "krb5"
brew "ksync"
brew "kubectx"
brew "kubernetes-cli"
brew "lame"
brew "lazygit"
brew "lftp" # Advanced FTP
brew "libavif" # Git Video
brew "lsd"
brew "lzip"
brew "macosvpn"
brew "mailsy"
brew "mas"
brew "maven"
brew "minikube"
brew "mycli" # SQL Terminal Client
brew "neofetch"
brew "nmap"
brew "node"
brew "npm"
brew "nsis"
brew "nvm"
brew "oh-my-posh" # Shell Theme
brew "ollama"
brew "openconnect"
brew "openvpn"
brew "oven-sh/bun/bun"
brew "pandoc"
brew "pdfgrep"
brew "perl"
brew "pkg-config" # Required by pdfgrep etc.
brew "poppler" # pdfinfo util
brew "potrace" # SVGify
brew "powershell"
brew "prettyping"
brew "pv"
brew "python3"
brew "rclone"
brew "reattach-to-user-namespace"
brew "ruby"
brew "rust"
brew "sloccount"
brew "socat"
brew "sox"
brew "speedtest-cli"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "virtualenv"
brew "watch"
brew "websocat"
brew "wget"
brew "xsv"
brew "yt-dlp"
brew "xz" # Required by many tools
brew "zsh"

cask "ableton-live-suite"
cask "aldente"
cask "apparency"
cask "appcleaner"
cask "arc"
cask "audio-hijack"
cask "blackhole-2ch"
cask "cursor"
cask "cyberduck"
cask "daisydisk"
cask "docker"
cask "eclipse-java"
cask "electrum"
cask "fission"
cask "font-hack-nerd-font"
cask "google-chrome" # lighthouse
cask "google-drive"
cask "gpg-suite"
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "keeweb"
cask "keka"
cask "macfuse"
cask "mactex-no-gui"
cask "mp3tag"
cask "pop"
cask "postico"
cask "postman"
cask "protonvpn"
cask "proxyman"
cask "rapidapi"
cask "raycast"
cask "rekordbox"
cask "rustdesk"
cask "shottr"
cask "signal"
cask "splice"
cask "spotify"
cask "tunnelblick"
cask "utm"
cask "vlc"
cask "vnc-viewer"
cask "windows-app"
cask "xquartz"

# Mac App Store
mas "Affinity Photo", id: 824183456 # Download manually from purchases
mas "Shazam", id: 897118787
mas "WireGuard", id: 1451685025
mas "Yubico Authenticator", id: 1497506650
