tap 'buo/cask-upgrade'
tap 'cloudfoundry/tap'
tap 'caskroom/versions'

# Binaries
brew 'adr-tools'
brew 'aria2'
brew 'asciinema'
brew 'atool'
brew 'awscli'
brew 'awslogs'
brew 'bash-completion'
brew 'cf-cli'
brew 'clang-format'
brew 'clojure'
brew 'cmake'
brew 'ctags'
brew 'curl'
brew 'diff-so-fancy'
brew 'dockutil'
brew 'duti'
brew 'emacs'
brew 'emojify'
brew 'ffmpeg'
brew 'fzf'
brew 'gcc'
brew 'gist'
brew 'git'
brew 'git-crypt'
brew 'gnu-sed'
brew 'gnupg'
brew 'golang'
brew 'gource' # Git Video
brew 'gpg-agent'
brew 'graphviz'
brew 'grep'
brew 'gs'
brew 'heroku'
brew 'htop'
brew 'httpie'
brew 'icdiff'
brew 'imagemagick' # SVGify
brew 'jq'
brew 'kubectl'
brew 'libav' # Git Video
brew 'macvim'
brew 'maven'
brew 'mono'
brew 'mpv'
brew 'mycli'
brew 'ncdu'
brew 'nmap'
brew 'npm'
brew 'openconnect'
brew 'openvpn'
brew 'p7zip'
brew 'pdfgrep'
brew 'potrace' # SVGify
brew 'prettyping'
brew 'progress'
brew 'python3'
brew 'reattach-to-user-namespace'
brew 'sloccount'
brew 'socat'
brew 'sshrc'
brew 'telnet'
brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'watchman'
brew 'zsh'

# Apps
cask 'adobe-acrobat-reader'
cask 'alfred'
cask 'android-platform-tools'
cask 'daisydisk'
cask 'docker'
cask 'expo-xde'
cask 'filezilla'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'gpgtools'
cask 'harvest'
cask 'inkscape'
cask 'intellij-idea'
cask 'iterm2'
cask 'java'
cask 'java-jdk-javadoc'
cask 'karabiner-elements'
cask 'keka'
cask 'libreoffice'
cask 'microsoft-office'
cask 'notion'
cask 'paw'
cask 'postico'
cask 'postman'
cask 'rar'
cask 'slack'
cask 'spotify'
cask 'teamviewer'
cask 'tunnelblick'
cask 'typora'
cask 'virtualbox'
cask 'vlc'
cask 'wireshark'
cask 'xquartz'

# Mac App Store
mas 'Affinity Photo', id: 824183456
