tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Binaries
brew "act" --HEAD # Run GitHub Actions
brew "adr-tools"
brew "aria2"
brew "asciinema"
brew "atool"
brew "awscli"
brew "awslogs"
brew "bash-completion"
brew "btop"
brew "clang-format"
brew "cmake"
brew "ctags"
brew "curl"
brew "derailed/k9s/k9s"
brew "diff-so-fancy"
brew "dive"
brew "dockutil"
brew "doctl"
brew "duti"
brew "emacs"
brew "emojify"
brew "exiftool"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "gist"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "golang"
brew "gource" # Git Video
brew "graphviz"
brew "grep"
brew "hashicorp/tap/packer"
brew "helm"
brew "htop"
brew "httpie"
brew "icdiff"
brew "imagemagick" # SVGify
brew "ioping"
brew "jesseduffield/lazygit/lazygit"
brew "jq"
brew "kubectx"
brew "kubernetes-cli"
brew "lame"
brew "lftp" # Advanced FTP
brew "libav" # Git Video
brew "lsd"
brew "lzip"
brew "mas"
brew "minikube"
brew "mpv"
brew "mycli"
brew "netlify-cli"
brew "nmap"
brew "node"
brew "npm"
brew "nvm"
brew "openconnect"
brew "openssl@1.1"
brew "openvpn"
brew "pdfgrep"
brew "perl"
brew "pidcat" --HEAD
brew "pipx"
brew "poetry"
brew "potrace" # SVGify
brew "prettyping"
brew "progress"
brew "pv"
brew "python3"
brew "reattach-to-user-namespace"
brew "rename"
brew "ruby"
brew "rust"
brew "sloccount"
brew "socat"
brew "sox"
brew "stow"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "viu"
brew "watch"
brew "websocat"
brew "wget"
brew "xsv"
brew "xz"
brew "zsh"

# Apps
cask "android-file-transfer"
cask "android-platform-tools"
cask "android-studio"
cask "audio-hijack"
cask "brave-browser"
cask "caffeine"
cask "coolterm"
cask "daisydisk"
cask "docker"
cask "electrum"
cask "fission"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite"
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "keeweb"
cask "keka"
cask "lando"
cask "macfuse"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "minecraft"
cask "mixed-in-key"
cask "mp3tag"
cask "paw"
cask "pop"
cask "postico"
cask "raycast"
cask "rekordbox"
cask "spotify"
cask "tunnelblick"
cask "utm"
cask "vcv-rack"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "xquartz"

# Mac App Store
mas "Affinity Photo", id: 824183456
mas "Shazam", id: 897118787
mas "WireGuard", id: 1451685025
mas "Yubico Authenticator", id: 1497506650
